11/data/attachments/2698945cea248030.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_9f3692d2-b0b2-4737-bae9-628b470a21ee</nif:username>
            <nif:friendToBeAdded>Jonathan_rich_Friend_37834_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>